api/app/models/meal.rb

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND "meals"."date" = $2  [["user_id", 72], ["date", "2019-09-02"]]
UPDATE "meals" SET "met_goal" = FALSE WHERE "meals"."user_id" = $1 AND "meals"."date" = $2  [["user_id", 72], ["date", "2019-09-02"]]
---
  def update_daily_totals
    daily_meals = Meal.where(user_id: user_id, date: date)
    daily_calories = daily_meals.map{ |meal| meal.calories }.compact.sum
    target_calories = user.calories
      if daily_calories >= target_calories
        daily_meals.update_all(met_goal: false)