api/app/models/review.rb

  def update_review_summaries
    restaurant.update(average_rating: restaurant.reviews.average(:rating))
    restaurant.update(lowest_rating: restaurant.reviews.minimum(:rating))
    restaurant.update(highest_rating: restaurant.reviews.maximum(:rating))
---
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
UPDATE "restaurants" SET "average_rating" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["average_rating", 3], ["updated_at", "2019-07-20 07:02:42.000916"], ["id", 1]]
SELECT MIN("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
UPDATE "restaurants" SET "updated_at" = $1, "lowest_rating" = $2 WHERE "restaurants"."id" = $3  [["updated_at", "2019-07-20 07:02:42.008359"], ["lowest_rating", 3], ["id", 1]]
SELECT MAX("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
UPDATE "restaurants" SET "updated_at" = $1, "highest_rating" = $2 WHERE "restaurants"."id" = $3  [["updated_at", "2019-07-20 07:02:42.014687"], ["highest_rating", 3], ["id", 1]]