api/app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    render json: Meal.all

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1  [["user_id", 54]]
---
  def my_meals
    render json: Meal.where(user_id: current_user.id)

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @meal = Meal.find(params[:id])

INSERT INTO "meals" ("text", "date", "time", "calories", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "dsfafdsa"], ["date", "2019-09-02"], ["time", 63000], ["calories", 5], ["user_id", 54]]
---
  def create
    params['meal']['user_id'] = current_user.id
    params['meal']['time'] = Time.at(params['meal']['time'])
    params['meal']['date'] = Date.parse(params['meal']['date'])
    Meal.create(meal_params)

UPDATE "meals" SET "user_id" = $1 WHERE "meals"."id" = $2  [["user_id", 72], ["id", 1]]
SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    params['meal']['user_id'] = current_user.id
    Meal.find(params['id']).update(meal_params)

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 1]]
---
  def destroy
    #return head 403 unless current_user.admin?
    Meal.find(params['id']).destroy

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1  [["user_id", 2]]
---
  def meals_for_user
    render json: Meal.where(user_id: params[:id])

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = $1 AND (startTime >= '21600') AND (endTime <= '28800')  [["user_id", 72]]
SELECT "meals".* FROM "meals" WHERE "meals"."date" BETWEEN $1 AND $2 AND "meals"."user_id" = $3  [["date", "2019-08-30"], ["date", "2019-10-03"], ["user_id", 58]]
---
  def filtered_meals
    params.permit(:startDate, :endDate, :endTime, :startTime)
    @meals = Meal.where(user_id: current_user.id)
    @meals = @meals.where("date >= ?", params[:startDate]) if params[:startDate]
    @meals = @meals.where("date <= ?", params[:endDate]) if params[:endDate]
    @meals = @meals.where("time >= ?", params[:startTime]) if params[:startTime]
    @meals = @meals.where("time <= ?", params[:endTime]) if params[:endTime]