api/app/controllers/restaurants_controller.rb

SELECT  DISTINCT reviews.created_at AS alias_0, "restaurants"."id" FROM "restaurants" LEFT OUTER JOIN "reviews" ON "reviews"."restaurant_id" = "restaurants"."id" WHERE "restaurants"."id" = $1 ORDER BY reviews.created_at desc LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.includes(:reviews).order("reviews.created_at desc").find(params[:id])