api/app/controllers/reviews_controller.rb

  def create
    params['review']['user_id'] = current_user.id
    Review.create(review_params)
---
INSERT INTO "reviews" ("rating", "user_comment", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 3], ["user_comment", "hello"], ["user_id", 1], ["restaurant_id", 1], ["created_at", "2019-07-20 07:02:41.871779"], ["updated_at", "2019-07-20 07:02:41.871779"]]