api/app/controllers/users_controller.rb

  def index
  	return head 403 unless current_user.admin? || current_user.user_manager?
    render json: User.all
---
SELECT "users".* FROM "users"

  def show
  	return head 403 unless current_user.admin? || current_user.user_manager?
    @meal = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
  	return head 403 unless current_user.admin? || current_user.user_manager?
    User.find(params[:user][:id]).update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "calories" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["calories", 555], ["updated_at", "2019-09-01 18:48:33.972467"], ["id", 4]]

  def destroy
  	return head 403 unless current_user.admin? || current_user.user_manager?
    User.find(params['id']).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]